#### Terraform Format and Style 🖌`failure`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```


Warning: Argument is deprecated

  with aws_eip.nat_gateway_eip,
  on infrastructure.tf line 52, in resource "aws_eip" "nat_gateway_eip":
  52:   vpc = true

use domain attribute instead
Success! The configuration is valid, but there were some validation warnings
as shown above.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
aws_secretsmanager_secret.AWS_SECRET_ACCESS_KEY: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht]
aws_ecr_repository.ECR_repository: Refreshing state... [id=ecs-runner]
aws_vpc.vpc: Refreshing state... [id=vpc-07498bf92e0c86bd9]
aws_iam_role.ecs_task_execution_role: Refreshing state... [id=ecs-runner_ecs_task_execution_role]
aws_eip.nat_gateway_eip: Refreshing state... [id=eipalloc-0e7fc431ff5a103e9]
aws_secretsmanager_secret.REPO: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-REPO-Oe3Bht]
aws_secretsmanager_secret.AWS_ACCESS_KEY_ID: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu]
aws_secretsmanager_secret.AWS_DEFAULT_REGION: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_DEFAULT_REGION-Ege2jc]
aws_secretsmanager_secret.ORG: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-ORG-4ggH6u]
aws_ecs_cluster.ecs_cluster: Refreshing state... [id=arn:aws:ecs:ap-south-1:508656221602:cluster/ecs-runner-cluster]
aws_cloudwatch_log_group.ecs-log-group: Refreshing state... [id=/ecs/ecs-runner-task-def]
aws_secretsmanager_secret.PAT: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-PAT-fgdVDt]
aws_iam_role_policy_attachment.ecs-task-execution-role-policy-attachment: Refreshing state... [id=ecs-runner_ecs_task_execution_role-20231113193744423200000001]
aws_iam_role_policy.password_policy_secretsmanager: Refreshing state... [id=ecs-runner_ecs_task_execution_role:password-policy-secretsmanager]
aws_iam_role_policy_attachment.admin-policy-attachment: Refreshing state... [id=ecs-runner_ecs_task_execution_role-20231113193744458800000002]
aws_secretsmanager_secret_version.AWS_SECRET_ACCESS_KEY_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht|4373E623-5C49-4FEE-915F-3911CA72D54A]
aws_secretsmanager_secret_version.AWS_ACCESS_KEY_ID_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu|BBD718A8-0792-4ADE-A711-D01B03DE306F]
aws_secretsmanager_secret_version.AWS_DEFAULT_REGION_version: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_DEFAULT_REGION-Ege2jc|82B59D96-9E50-4ABE-B34B-931684C50975]
aws_ecs_task_definition.task_definition: Refreshing state... [id=ecs-runner-task-def]
aws_internet_gateway.int_gateway: Refreshing state... [id=igw-01c1b694a42658781]
aws_subnet.public_subnet: Refreshing state... [id=subnet-0685110895bc6f5ee]
aws_subnet.private_subnet: Refreshing state... [id=subnet-04f6bd53f3b41f090]
aws_security_group.ecs_sg: Refreshing state... [id=sg-0393461826a5b8a29]
aws_route_table.route_table_public: Refreshing state... [id=rtb-063216b5f5f2501f8]
aws_nat_gateway.nat_gateway: Refreshing state... [id=nat-0080321254bfa3ed1]
aws_ecs_service.ecs_service: Refreshing state... [id=arn:aws:ecs:ap-south-1:508656221602:service/ecs-runner-cluster/ecs-runner-ecs-service]
aws_route_table_association.assoc_1: Refreshing state... [id=rtbassoc-0db31f2d7338db67b]
aws_route_table.route_table_private: Refreshing state... [id=rtb-00757056dc1d18288]
aws_appautoscaling_target.dev_to_target: Refreshing state... [id=service/ecs-runner-cluster/ecs-runner-ecs-service]
aws_route_table_association.assoc_2: Refreshing state... [id=rtbassoc-09bca5dc650e00b1b]
aws_appautoscaling_policy.dev_to_memory: Refreshing state... [id=dev-to-memory]
aws_appautoscaling_policy.dev_to_cpu: Refreshing state... [id=dev-to-cpu]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_route_table.route_table_private will be updated in-place
  ~ resource "aws_route_table" "route_table_private" {
        id               = "rtb-00757056dc1d18288"
      ~ route            = [
          - {
              - carrier_gateway_id         = ""
              - cidr_block                 = "0.0.0.0/0"
              - core_network_arn           = ""
              - destination_prefix_list_id = ""
              - egress_only_gateway_id     = ""
              - gateway_id                 = ""
              - ipv6_cidr_block            = ""
              - local_gateway_id           = ""
              - nat_gateway_id             = "nat-0080321254bfa3ed1"
              - network_interface_id       = ""
              - transit_gateway_id         = ""
              - vpc_endpoint_id            = ""
              - vpc_peering_connection_id  = ""
            },
          + {
              + carrier_gateway_id         = ""
              + cidr_block                 = "0.0.0.0/0"
              + core_network_arn           = ""
              + destination_prefix_list_id = ""
              + egress_only_gateway_id     = ""
              + gateway_id                 = "nat-0080321254bfa3ed1"
              + ipv6_cidr_block            = ""
              + local_gateway_id           = ""
              + nat_gateway_id             = ""
              + network_interface_id       = ""
              + transit_gateway_id         = ""
              + vpc_endpoint_id            = ""
              + vpc_peering_connection_id  = ""
            },
        ]
        tags             = {
            "Name" = "ecs-runner_private"
        }
        # (5 unchanged attributes hidden)
    }

  # aws_secretsmanager_secret_version.AWS_ACCESS_KEY_ID_version must be replaced
-/+ resource "aws_secretsmanager_secret_version" "AWS_ACCESS_KEY_ID_version" {
      ~ arn            = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_ACCESS_KEY_ID-Ce6nJu|BBD718A8-0792-4ADE-A711-D01B03DE306F" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "BBD718A8-0792-4ADE-A711-D01B03DE306F" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.AWS_SECRET_ACCESS_KEY_version must be replaced
-/+ resource "aws_secretsmanager_secret_version" "AWS_SECRET_ACCESS_KEY_version" {
      ~ arn            = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht" -> (known after apply)
      ~ id             = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-AWS_SECRET_ACCESS_KEY-Oe3Bht|4373E623-5C49-4FEE-915F-3911CA72D54A" -> (known after apply)
      ~ secret_string  = (sensitive value) # forces replacement
      ~ version_id     = "4373E623-5C49-4FEE-915F-3911CA72D54A" -> (known after apply)
      ~ version_stages = [
          - "AWSCURRENT",
        ] -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # aws_secretsmanager_secret_version.ORG_version will be created
  + resource "aws_secretsmanager_secret_version" "ORG_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-ORG-4ggH6u"
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.PAT_version will be created
  + resource "aws_secretsmanager_secret_version" "PAT_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-PAT-fgdVDt"
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

  # aws_secretsmanager_secret_version.REPO_version will be created
  + resource "aws_secretsmanager_secret_version" "REPO_version" {
      + arn            = (known after apply)
      + id             = (known after apply)
      + secret_id      = "arn:aws:secretsmanager:ap-south-1:508656221602:secret:ecs-runner-REPO-Oe3Bht"
      + secret_string  = (sensitive value)
      + version_id     = (known after apply)
      + version_stages = (known after apply)
    }

Plan: 5 to add, 1 to change, 2 to destroy.

Warning: Argument is deprecated

  with aws_eip.nat_gateway_eip,
  on infrastructure.tf line 52, in resource "aws_eip" "nat_gateway_eip":
  52:   vpc = true

use domain attribute instead

(and one more similar warning elsewhere)

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @pkj1993, Action: `pull_request`*